---
kind: other
id: Methods.T:Autodesk.Revit.DB.Mechanical.MechanicalEquipmentSetType
source: html/5f0cc1f5-4af0-1763-94b7-36ceaa3b5150.htm
---
# MechanicalEquipmentSetType Methods

Returns true if the properties CreatedPhaseId and DemolishedPhaseId can be modified for this Element.